In [13]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [14]:
path = 'EmployeeAttrition.csv'
df = pd.read_csv(path)
df

,MMM-YY,Emp_ID,Age,Gender,City,Education_Level,Salary,Dateofjoining,LastWorkingDate,Joining Designation,Designation,Total Business Value,Quarterly Rating
0,2016-01-01,1,28,Male,C23,Master,57387,2015-12-24,NaN,1,1,2381060,2
1,2016-02-01,1,28,Male,C23,Master,57387,2015-12-24,NaN,1,1,-665480,2
2,2016-03-01,1,28,Male,C23,Master,57387,2015-12-24,2016-03-11,1,1,0,2
3,2017-11-01,2,31,Male,C7,Master,67016,2017-11-06,NaN,2,2,0,1
4,2017-12-01,2,31,Male,C7,Master,67016,2017-11-06,NaN,2,2,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19099,2017-08-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,740280,3
19100,2017-09-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,448370,3
19101,2017-10-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,0,2
19102,2017-11-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,200420,2
19103,2017-12-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,411480,2

In [15]:
# Confirm start and end dates of data set. Confirm number of employees.
print(df['Emp_ID'].nunique())
print(df['MMM-YY'].max())
print(df['MMM-YY'].min())

2381
2017-12-01
2016-01-01

In [16]:
# Get start date of each employee
gr_df = df.groupby('Emp_ID')
start_date = gr_df['Dateofjoining'].min()
start_date

Emp_ID
1       2015-12-24
2       2017-11-06
4       2016-12-07
5       2016-01-09
6       2017-07-31
           ...
2784    2012-10-15
2785    2017-08-28
2786    2015-07-31
2787    2015-07-21
2788    2017-06-08
Name: Dateofjoining, Length: 2381, dtype: object

In [17]:
# Confirm where Na values are . .

In [18]:
# Get finish date of each employee. If last day is blank, employee still here (Dec 2017)
att_emp = df.dropna()
len(att_emp)
att_emp = att_emp.reset_index()
att_emp.columns

Index(['index', 'MMM-YY', 'Emp_ID', 'Age', 'Gender', 'City', 'Education_Level',
       'Salary', 'Dateofjoining', 'LastWorkingDate', 'Joining Designation',
       'Designation', 'Total Business Value', 'Quarterly Rating'],
      dtype='object')

In [19]:
ae_se = att_emp[['Emp_ID','LastWorkingDate']]
ae_se

      Emp_ID LastWorkingDate
0          1      2016-03-11
1          4      2017-04-27
2          5      2016-03-07
3          8      2017-11-15
4         12      2016-12-21
...      ...             ...
1611    2779      2017-02-14
1612    2782      2016-08-16
1613    2785      2017-10-28
1614    2786      2016-09-22
1615    2787      2016-06-20

[1616 rows x 2 columns]

In [20]:
# create new df to store information
# add employee name, columns for start date, finish date & tenure
new_df = pd.DataFrame(start_date)

new_df = new_df.reset_index()
new_df = pd.merge(new_df, ae_se, how='left', on=['Emp_ID'])
new_df['Tenure']=""
new_df

      Emp_ID Dateofjoining LastWorkingDate Tenure
0          1    2015-12-24      2016-03-11
1          2    2017-11-06             NaN
2          4    2016-12-07      2017-04-27
3          5    2016-01-09      2016-03-07
4          6    2017-07-31             NaN
...      ...           ...             ...    ...
2376    2784    2012-10-15             NaN
2377    2785    2017-08-28      2017-10-28
2378    2786    2015-07-31      2016-09-22
2379    2787    2015-07-21      2016-06-20
2380    2788    2017-06-08             NaN

[2381 rows x 4 columns]

In [21]:
# Formula to calculate Tenure
new_df['Current_status'] = new_df['LastWorkingDate']
# new_df['Current_status'] = new_df['Current_status'].fillna(1)


new_df

      Emp_ID Dateofjoining LastWorkingDate Tenure Current_status
0          1    2015-12-24      2016-03-11            2016-03-11
1          2    2017-11-06             NaN                   NaN
2          4    2016-12-07      2017-04-27            2017-04-27
3          5    2016-01-09      2016-03-07            2016-03-07
4          6    2017-07-31             NaN                   NaN
...      ...           ...             ...    ...            ...
2376    2784    2012-10-15             NaN                   NaN
2377    2785    2017-08-28      2017-10-28            2017-10-28
2378    2786    2015-07-31      2016-09-22            2016-09-22
2379    2787    2015-07-21      2016-06-20            2016-06-20
2380    2788    2017-06-08             NaN                   NaN

[2381 rows x 5 columns]

In [25]:
# If LastWorkingDate ==Nan current_status == 1
# else current
new_df["Current Status"] = new_df.loc[new_df['LastWorkingDate'] != "NaN" , ['LastWorkingDate'] == 1]
new_df

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().